; domain
(define (domain hanoi-domain)
    (:predicates 
        (on-tower ?d ?t) ; disk d is on tower t
        (on-disk ?d1 ?d2) ; disk d1 is on disk d2
        (disk ?d) ; d is a disk
        (tower ?t) ; t is a tower
        (empty ?t) ; tower t is empty
        (smaller ?d1 ?d2) ; disk d1 is smaller than disk d2
        (on-top ?d ?t) ; disk d is on top of tower t
    )
    
    ; move disk from disk to tower
    ; ?d is the disk to move
    ; ?df is the disk under disk ?d
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower to move ?d to
    (:action move-d-to-t
        :parameters (?d ?df ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (disk ?df)
            (tower ?t1)
            (tower ?t2)
            (empty ?t2)
            (on-disk ?d ?df)
            (on-top ?d ?t1)
            )
        :effect (and 
            (on-top ?df ?t1)
            (not (empty ?t2))
            (not (on-disk ?d ?df))
            (on-tower ?d ?t2)
            (on-top ?d ?t2)
            (not (on-top ?d ?t1))
            )
    )
    
    ; move disk from disk to disk
    ; ?d is the disk to move
    ; ?df is the disk under disk ?d
    ; ?dt is the disk to move ?d to
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower ?dt is on
    (:action move-d-to-d
        :parameters (?d ?df ?dt ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (disk ?df)
            (disk ?dt)
            (on-top ?d ?t1)
            (on-top ?dt ?t2)
            (tower ?t1)
            (tower ?t2)
            (on-disk ?d ?df)
            (smaller ?d ?dt)
            )
        :effect (and 
            (on-top ?df ?t1)
            (not (on-top ?d ?t1))
            (on-top ?d ?t2)
            (on-disk ?d ?dt)
            (not (on-top ?dt ?t2))
            (not (on-disk ?d ?df))
            )
    )

    ; move disk from tower to tower
    ; ?d is the disk to move
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower to move ?d to
    (:action move-t-to-t
        :parameters (?d ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (tower ?t1)
            (tower ?t2)
            (empty ?t2)
            (on-tower ?d ?t1)
            (on-top ?d ?t1)
            )
        :effect (and
            (empty ?t1)
            (not (empty ?t2))
            (on-tower ?d ?t2)
            (not (on-tower ?d ?t1))
            (on-top ?d ?t2)
            (not (on-top ?d ?t1))
            )
    )

    ; move disk from tower to disk
    ; ?d is the disk to move
    ; ?dt is the disk to move ?d to
    ; ?t1 is the tower ?d is on
    ; ?t2 is the tower ?dt is on
    (:action move-t-to-d
        :parameters (?d ?dt ?t1 ?t2)
        :precondition (and 
            (disk ?d)
            (disk ?dt)
            (tower ?t1)
            (tower ?t2)
            (on-top ?d ?t1)
            (on-tower ?d ?t1)
            (on-top ?dt ?t2)
            (smaller ?d ?dt)
            )
        :effect (and
            (not (on-top ?d ?t1))
            (on-top ?d ?t2)
            (not (on-tower ?d ?t1))
            (empty ?t1)
            (on-disk ?d ?dt)
            (not (on-top ?dt ?t2))
        )
    )
)

; problem
(define (problem hanoi-problem) (:domain hanoi-domain)
    (:objects
        tower1 tower2 tower3
        disk1 disk2 disk3 
    )
    
    (:init
        (tower tower1)
        (tower tower2)
        (tower tower3)
        (disk disk1)
		(on-disk disk1 disk2)
		(smaller disk1 disk2)
		(smaller disk1 disk3)
		(disk disk2)
		(on-disk disk2 disk3)
		(smaller disk2 disk3)
		(disk disk3)
		(on-tower disk3 tower1)
		(not (empty tower1))
        (empty tower2)
        (empty tower3)
        (on-top disk1 tower1)
    )
        
    (:goal (and
        (empty tower1)
        (empty tower2)
        (on-top disk1 tower3)
        (on-disk disk1 disk2)
		(on-disk disk2 disk3)
		(on-tower disk3 tower3)
		)
	)
)

; plan
1. (move-d-to-t disk1 disk2 tower1 tower3)
   deleted: (empty tower3) (on-disk disk1 disk2) (on-top disk1 tower1)
   added: (on-top disk2 tower1) (on-tower disk1 tower3) (on-top disk1 tower3)
   goals met: 3 of 6
2. (move-d-to-t disk2 disk3 tower1 tower2)
   deleted: (empty tower2) (on-disk disk2 disk3) (on-top disk2 tower1)
   added: (on-top disk3 tower1) (on-tower disk2 tower2) (on-top disk2 tower2)
   goals met: 1 of 6
3. (move-t-to-d disk1 disk2 tower3 tower2)
   deleted: (on-top disk1 tower3) (on-tower disk1 tower3) (on-top disk2 tower2)
   added: (on-top disk1 tower2) (empty tower3) (on-disk disk1 disk2)
   goals met: 1 of 6
4. (move-t-to-t disk3 tower1 tower3)
   deleted: (empty tower3) (on-tower disk3 tower1) (on-top disk3 tower1)
   added: (empty tower1) (on-tower disk3 tower3) (on-top disk3 tower3)
   goals met: 3 of 6
5. (move-d-to-t disk1 disk2 tower2 tower1)
   deleted: (empty tower1) (on-disk disk1 disk2) (on-top disk1 tower2)
   added: (on-top disk2 tower2) (on-tower disk1 tower1) (on-top disk1 tower1)
   goals met: 1 of 6
6. (move-t-to-d disk2 disk3 tower2 tower3)
   deleted: (on-top disk2 tower2) (on-tower disk2 tower2) (on-top disk3 tower3)
   added: (on-top disk2 tower3) (empty tower2) (on-disk disk2 disk3)
   goals met: 3 of 6
7. (move-t-to-d disk1 disk2 tower1 tower3)
   deleted: (on-top disk1 tower1) (on-tower disk1 tower1) (on-top disk2 tower3)
   added: (on-top disk1 tower3) (empty tower1) (on-disk disk1 disk2)
   goals met: 6 of 6
